DELETE FROM `address_postal_irregular`;
ALTER TABLE `address_postal_irregular` auto_increment = 0;

INSERT INTO `address_postal_irregular` (`address_postal_irregular_id`,`postalcode1`,`postalcode2`,`is_latest`,`lg_code`,`address_org`,`address_name`,`address_postal`,`address_block`,`is_add_postal`,`is_repair_rsdt`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) VALUES (1,'060','8613',1,'011011','北一条西','４丁目２－２札幌ノースプラザ１０Ｆ','北海道札幌市中央区北一条西','４丁目２－２札幌ノースプラザ１０Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59');
INSERT INTO `address_postal_irregular` (`address_postal_irregular_id`,`postalcode1`,`postalcode2`,`is_latest`,`lg_code`,`address_org`,`address_name`,`address_postal`,`address_block`,`is_add_postal`,`is_repair_rsdt`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) VALUES (2,'060','8703',1,'011011','北一条西','９丁目１－５（札幌中央郵便局私書箱第２９号）','北海道札幌市中央区北一条西','９丁目１－５（札幌中央郵便局私書箱第２９号）',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59');
INSERT INTO `address_postal_irregular` (`address_postal_irregular_id`,`postalcode1`,`postalcode2`,`is_latest`,`lg_code`,`address_org`,`address_name`,`address_postal`,`address_block`,`is_add_postal`,`is_repair_rsdt`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) VALUES (3,'060','8537',1,'011011','南一条西','４丁目２０番地','北海道札幌市中央区南一条西','４丁目２０番地',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59');
INSERT INTO `address_postal_irregular` (`address_postal_irregular_id`,`postalcode1`,`postalcode2`,`is_latest`,`lg_code`,`address_org`,`address_name`,`address_postal`,`address_block`,`is_add_postal`,`is_repair_rsdt`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) 
 VALUES 
     (1254,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（地階・階層不明）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1255,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（１階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1256,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（２階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1257,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（３階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1258,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（４階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1259,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（５階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1260,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（６階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1261,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（７階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1262,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（８階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1263,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（９階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1264,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（１０階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1265,'330','6003',1,'011011','新都心明治安田生命さいたま新都心ビル（１１階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (1266,'330','6003',0,'011011','新都心明治安田生命さいたま新都心ビル（１２階）','新都心明治安田生命さいたま新都心ビル','東京都千代田区丸の内','一丁目11番1号',0,0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
  ;
  
  
  