DELETE FROM `address_postal`;
ALTER TABLE `address_postal` auto_increment = 0;

INSERT INTO `address_postal` (`address_postal_id`,`postalcode1`,`postalcode2`,`is_latest`,`lg_code`,`address_org`,`address_name`,`is_gyoseiku_data`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) 
   VALUES 
      (441,'001','1234',0,'011029','北十五条西一丁目','北海道札幌市北区北十五条西一丁目',1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (442,'011','1234',1,'011029','北十五条西二丁目','北海道札幌市北区北十五条西二丁目',1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (443,'011','2345',1,'011029','北十五条西三丁目','北海札幌市北区北十五条西六丁目',1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (444,'022','3456',1,'011029','北十五条西四丁目','北海道札幌市北区北十五条西四丁目',1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (445,'022','4567',1,'011029','北十五条西五丁目','北海道札幌市北区北十五条西五丁目',1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (446,'022','4568',1,'011029','北十五条西五丁目','北海札幌市北区北十五条西六丁目',1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
;
