DELETE FROM `kanrensha_kigyou_dt_access`;
ALTER TABLE `kanrensha_kigyou_dt_access` auto_increment = 0;

DELETE FROM `kanrensha_kigyou_dt_address`;
ALTER TABLE `kanrensha_kigyou_dt_address` auto_increment = 0;

DELETE FROM `kanrensha_kigyou_dt_master`;
ALTER TABLE `kanrensha_kigyou_dt_master` auto_increment = 0;

DELETE FROM `kanrensha_kigyou_dt_property`;
ALTER TABLE `kanrensha_kigyou_dt_property` auto_increment = 0;


INSERT INTO `kanrensha_kigyou_dt_master` (`kanrensha_kigyou_dt_master_id`,`kigyou_dt_kanrensha_code`,`is_latest`,`kanrensha_name`,`all_address`,`kigyou_dt_delegate`,`compare_name_text`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`)
  VALUES 
  -- 移動対象(1)
   (390,'12345',1,'どっちつかず企業1a','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(165,'12345',0,'どっちつかず企業1b','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-25 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(166,'12345',0,'どっちつかず企業1c','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-22 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(391,'98765',1,'どっちつかず企業2a','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-26 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(242,'98765',0,'どっちつかず企業2b','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-23 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(243,'98765',0,'どっちつかず企業2c','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-24 16:30:24',0,0,'','1948-07-28 23:59:59')
  -- 移動対象(2)
  ,(490,'23456',1,'どっちつかず企業3a','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(265,'23456',0,'どっちつかず企業3b','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-25 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(266,'23456',0,'どっちつかず企業3c','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-22 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(491,'87654',1,'どっちつかず企業4a','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-26 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(342,'87654',0,'どっちつかず企業4b','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-23 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(343,'87654',0,'どっちつかず企業4c','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-24 16:30:24',0,0,'','1948-07-28 23:59:59')
  
  
  -- 夾雑物
  ,(392,'22222',1,'どっちつかず企業','宮崎県架空市橘通東２丁目１０−１','代表者','迂回献金ミカエル太郎',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ;


INSERT INTO `kanrensha_kigyou_dt_access` (`kanrensha_kigyou_dt_access_id`,`kanrensha_kigyou_dt_id`,`kigyou_dt_kanrensha_code`,`kanrensha_name`,`is_latest`,`phon1`,`phon2`,`phon3`,`email`,`my_portal_url`,`sns_service_id`,`sns_service_code`,`sns_service_name`,`sns_portal_url`,`sns_account`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`)
  VALUES 
  -- 移動対象(1)
   (656,390,'12345','どっちつかず企業1a',1,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(524,165,'12345','どっちつかず企業1b',0,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(525,166,'12345','どっちつかず企業1c',0,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(657,391,'98765','どっちつかず企業2a',1,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(526,242,'98765','どっちつかず企業2b',0,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(527,243,'98765','どっちつかず企業2c',0,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  -- 移動対象(2)
  ,(756,490,'23456','どっちつかず企業3a',1,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(624,265,'23456','どっちつかず企業3b',0,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(625,266,'23456','どっちつかず企業3c',0,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(757,491,'87654','どっちつかず企業4a',1,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(626,342,'87654','どっちつかず企業4b',0,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(627,343,'87654','どっちつかず企業4c',0,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  -- 夾雑物
  ,(658,392,'22222','どっちつかず企業',1,'0985','26','7132','test@example.com','https://my-portal/index.html',0,0,'弱小SNS','https://jyakusho-sns/','@taro123456',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ;


INSERT INTO `kanrensha_kigyou_dt_address` (`kanrensha_kigyou_dt_address_id`,`kanrensha_kigyou_dt_id`,`kigyou_dt_kanrensha_code`,`kanrensha_name`,`is_latest`,`postalcode1`,`postalcode2`,`address_postal`,`address_block`,`address_building`,`lg_code`,`machiaza_id`,`blk_id`,`prc_id`,`rsdt_id`,`rsdt2_id`,`is_postal_edit`,`is_block_edit`,`is_building_edit`,`is_postal_accept`,`is_block_accept`,`is_building_accept`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) VALUES 
  -- 移動対象(1)
   (774,390,'12345','どっちつかず企業1a',1,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(651,165,'12345','どっちつかず企業1b',0,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(652,166,'12345','どっちつかず企業1c',0,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(775,391,'98765','どっちつかず企業2a',1,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(653,242,'98765','どっちつかず企業2b',0,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(654,243,'98765','どっちつかず企業2c',0,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  -- 移動対象(2)
  ,(874,490,'23456','どっちつかず企業3a',1,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(751,265,'23456','どっちつかず企業3b',0,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(752,266,'23456','どっちつかず企業3c',0,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(875,491,'87654','どっちつかず企業4a',1,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(753,342,'87654','どっちつかず企業4b',0,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(754,343,'87654','どっちつかず企業4c',0,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  -- 夾雑物
  ,(776,392,'22222','どっちつかず企業',1,'880','8501','宮崎県架空市橘通東','２丁目１０−１','宮崎県庁','131016','324','131','249','136','978',1,1,1,0,0,0,196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
;

INSERT INTO `kanrensha_kigyou_dt_property` (`kanrensha_kigyou_dt_property_id`,`kanrensha_kigyou_dt_id`,`kigyou_dt_kanrensha_code`,`kanrensha_name`,`is_latest`,`houjin_sbts`,`is_foreign`,`org_name_kana`,`is_shiten`,`org_delegate_code`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`)
  VALUES 
  -- 移動対象(1)
   (824,390,'12345','どっちつかず企業1a',1,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(711,165,'12345','どっちつかず企業1b',0,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(712,166,'12345','どっちつかず企業1c',0,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(825,391,'98765','どっちつかず企業2a',1,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(713,242,'98765','どっちつかず企業2b',0,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(714,243,'98765','どっちつかず企業2c',0,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  -- 移動対象(2)
  ,(924,490,'23456','どっちつかず企業3a',1,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(811,265,'23456','どっちつかず企業3b',0,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(812,266,'23456','どっちつかず企業3c',0,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(925,491,'87654','どっちつかず企業4a',1,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(813,342,'87654','どっちつかず企業4b',0,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(814,343,'87654','どっちつかず企業4c',0,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ,(826,392,'22222','どっちつかず企業',1,'株式',1,'うかいけんきんみかえるたろう',0,'1-2345',196,190,'管理人 太郎','2025-12-27 16:30:24',0,0,'','1948-07-28 23:59:59')
  ;
