DELETE FROM `wk_tbl_address_rsdt_file`;
ALTER TABLE `wk_tbl_address_rsdt_file` auto_increment = 0;

INSERT INTO `wk_tbl_address_rsdt_file` (`wk_tbl_address_rsdt_file_id`,`lg_code`,`postalcode1`,`postalcode2`,`is_latest`,`address_block`,`address_building`,`machiaza_id`,`blk_id`,`prc_id`,`rsdt_id`,`rsdt2_id`,`effect_date`,`abolish_date`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`)
VALUES
   (245,'45202','777','8888',1,'札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',196,190,'管理人　太郎','2026-05-27 06:21:10',0,0,'','1948-07-28 23:59:59')
 , (246,'45202','777','8888',0,'札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',196,190,'管理人　太郎','2026-05-27 06:21:10',0,0,'','1948-07-28 23:59:59')
 , (247,'45202','777','8888',1,'札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',113,266,'管理人　太郎','2026-05-27 06:21:10',0,0,'','1948-07-28 23:59:59')
 , (248,'45202','777','8888',1,'札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',196,190,'管理人　太郎','2026-05-27 06:21:10',0,0,'','1948-07-28 23:59:59')
;
