DELETE FROM `wk_tbl_address_rsdt_change`;
ALTER TABLE `wk_tbl_address_rsdt_change` auto_increment = 0;

INSERT INTO `wk_tbl_address_rsdt_change` (`wk_tbl_address_rsdt_change_id`,`address_rsdt_id`,`lg_code`,`postalcode1`,`postalcode2`,`is_latest`,`address_block`,`address_building`,`machiaza_id`,`blk_id`,`prc_id`,`rsdt_id`,`rsdt2_id`,`effect_date`,`abolish_date`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) 
  VALUES 
      (331,2,'827637','','',1,'北海道石狩郡当別町425番地の37','','1','2','3','4','5','1948-07-28','1948-07-28',196,460,'管理人　太郎','2026-05-30 06:24:32',0,0,'','1948-07-28 23:59:59')
    , (332,0,'827637','','',0,'北海道石狩郡当別町425番地37号','','9','2','3','4','5','1948-07-28','1948-07-28',196,190,'管理人　太郎','2026-05-30 06:24:32',0,0,'','1948-07-28 23:59:59')
    , (333,0,'827637','','',1,'北海道石狩郡当別町425番地37号','','1','9','3','4','5','1948-07-28','1948-07-28',196,190,'管理人　太郎','2026-05-30 06:24:32',0,0,'','1948-07-28 23:59:59')
    , (334,0,'827637','','',1,'北海道石狩郡当別町425番地37号','','1','2','9','4','5','1948-07-28','1948-07-28',196,190,'管理人　太郎','2026-05-30 06:24:32',0,0,'','1948-07-28 23:59:59')
    , (335,0,'827637','','',1,'北海道石狩郡当別町425番地37号','','1','2','3','9','5','1948-07-28','1948-07-28',196,190,'管理人　太郎','2026-05-30 06:24:32',0,0,'','1948-07-28 23:59:59')
    ;

