DELETE FROM `wk_tbl_address_rsdt_delete`;
ALTER TABLE `wk_tbl_address_rsdt_delete` auto_increment = 0;

INSERT INTO `wk_tbl_address_rsdt_delete` (`wk_tbl_address_rsdt_delete_id`,`address_rsdt_id`,`lg_code`,`postalcode1`,`postalcode2`,`is_latest`,`address_block`,`address_building`,`machiaza_id`,`blk_id`,`prc_id`,`rsdt_id`,`rsdt2_id`,`effect_date`,`abolish_date`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) 
   VALUES 
      (522,140,'452020','','',1,'札幌市豊平区月寒東五条十八丁目aaa17番地11号','','0013018','334','017','556','245','1948-07-28','1948-07-28',196,190,'管理人　太郎','2026-05-30 07:55:54',0,0,'','1948-07-28 23:59:59')
    , (523,141,'452020','','',1,'','','0013018','334','017','556','246','1948-07-28','1948-07-28',196,190,'管理人　太郎','2026-05-30 07:55:54',0,0,'','1948-07-28 23:59:59')
    , (524,143,'452020','','',1,'','','013018','334','017','556','247','1948-07-28','1948-07-28',196,190,'管理人　太郎','2026-05-30 07:55:54',0,0,'','1948-07-28 23:59:59')
    , (525,144,'452020','','',1,'','','0013018','1334','017','556','247','1948-07-28','1948-07-28',196,335,'管理人　太郎','2026-05-30 07:55:54',0,0,'','1948-07-28 23:59:59')
    , (526,5,'452020','','',1,'','','0013018','334','1017','556','247','1948-07-28','1948-07-28',196,190,'管理人　太郎','2026-05-30 07:55:54',0,0,'','1948-07-28 23:59:59')
;
      
