DELETE FROM `address_postal_irregular`;
ALTER TABLE `address_postal_irregular` auto_increment = 0;


INSERT INTO `address_postal_irregular` (`address_postal_irregular_id`,`postalcode1`,`postalcode2`,`is_latest`,`lg_code`,`address_org`,`address_name`,`address_postal`,`address_block`,`is_add_postal`,`is_repair_rsdt`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`)
  VALUES 
     (830,'060','8515',1,'011011','八幡町（五の沢）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (831,'060','8515',1,'011011','八幡町（高岡）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (832,'060','8515',0,'011011','八幡町（高岡）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (833,'060','8515',1,'021011','八幡町（高岡）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (834,'060','8515',1,'021011','八幡町（その他）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (835,'060','8515',1,'021011','八幡町（３階）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (836,'060','8515',1,'021011','八幡町（地階、階層不明）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (837,'060','8515',1,'021011','八幡町（３番地～５番地）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   , (838,'060','8515',1,'021011','八幡町（３丁目、７丁目）','１丁目１マルイト札幌ビル９Ｆ','北海道札幌市中央区北二条西','１丁目１マルイト札幌ビル９Ｆ',1,1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
   ;
-- 上から順に最新でない、地方公共団体が該当しない、、その他、ビル階、ビル地階、番地範囲、丁目範囲