DELETE FROM `address_postal`;
ALTER TABLE `address_postal` auto_increment = 0;


INSERT INTO `address_postal` (`address_postal_id`,`postalcode1`,`postalcode2`,`is_latest`,`lg_code`,`address_org`,`address_name`,`is_gyoseiku_data`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`)
  VALUES 
     (851,'100','6415',0,'011121','藤野（その他）','北海道札幌市南区藤野',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    ,(852,'100','6415',0,'011121','真駒内','北海道札幌市南区真駒内',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    ,(853,'100','6415',1,'011121','藤野（その他）','北海道札幌市南区藤野',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    ,(854,'100','6415',1,'011121','真駒内（その他）','北海道札幌市南区真駒内',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    ,(855,'100','6415',1,'011121','藤野一条','北海道札幌市南区藤野',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    ,(856,'100','6415',1,'011121','真駒内三丁目','北海道札幌市南区真駒内',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    ;
