DELETE FROM `address_rsdt_template`;
ALTER TABLE `address_rsdt_template` auto_increment = 0;


INSERT INTO `address_rsdt_template` (`address_rsdt_id`,`lg_code`,`postalcode1`,`postalcode2`,`is_latest`,`address_block`,`address_building`,`machiaza_id`,`blk_id`,`prc_id`,`rsdt_id`,`rsdt2_id`,`effect_date`,`abolish_date`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`)
  VALUES 
    -- 最新でない
      (322,'template','','',0,'北海道札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',1,1,'1','2026-03-07 12:57:10',0,0,'','1948-07-28 23:59:59')
    -- 番地まで住所が異なる
    , (323,'template','','',1,'北海道札幌市豊平区月寒東六条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',1,1,'1','2026-03-07 12:57:10',0,0,'','1948-07-28 23:59:59')
    -- 郵便番号1が入力済
    , (324,'template','493','',1,'北海道札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',1,1,'1','2026-03-07 12:57:10',0,0,'','1948-07-28 23:59:59')
    -- 郵便番号2が入力済
    , (325,'template','','7979',1,'北海道札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',1,1,'1','2026-03-07 12:57:10',0,0,'','1948-07-28 23:59:59')
    -- 以下更新
    , (326,'template','','',1,'北海道札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',1,1,'1','2026-03-07 12:57:10',0,0,'','1948-07-28 23:59:59')
    , (327,'template','','',1,'北海道札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',1,1,'1','2026-03-07 12:57:10',0,0,'','1948-07-28 23:59:59')
    , (328,'template','','',1,'北海道札幌市豊平区月寒東五条十八丁目aaa17番地11号','99号室','0013018','334','017','556','778','2022-11-19','2041-02-06',1,1,'1','2026-03-07 12:57:10',0,0,'','1948-07-28 23:59:59')
    ;
