DELETE FROM `riyousha_combine_org_temp`;
ALTER TABLE `riyousha_combine_org_temp` auto_increment = 0;

  
INSERT INTO `riyousha_combine_org_temp` (`riyousha_combine_org_temp_id`,`riyousha_combine_org_temp_code`,`is_latest`,`riyousha_role`,`person_code`,`person_riyousha_code`,`person_riyousha_name`,`org_riyousha_code`,`org_name`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`)
   VALUES 
   -- QueryParamで取得する
    (731,654,1,'manager',186,246,'管理者太郎',383,'組織E',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   -- QueryParamで取得する(最新でない)
    ,(732,654,0,'manager',186,246,'管理者太郎',383,'組織E',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   -- QueryParamで取得する(権限が合わない)
    ,(733,654,1,'kanrensha_person',186,246,'管理者太郎',383,'組織E',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   -- QueryParamで取得する(個人コードが合わない)
    ,(734,654,1,'manager',186,398,'管理者太郎',383,'組織E',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   -- QueryParamで取得する(組織コードが合わない)
    ,(735,654,1,'manager',186,246,'管理者太郎',4755,'組織E',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   -- QueryParamで取得する(該当するがId順／そもそも登録させちゃダメ?)
    ,(736,654,1,'manager',186,246,'管理者太郎',383,'組織E',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   -- ユーザコードで取得する
   ,(755,654,1,'ROLE_partner_api',190,186,'管理者太郎',216,'政治資金文書製作所',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   ,(756,655,1,'ROLE_manager',190,186,'管理者花子',216,'政治資金文書製作所',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   ,(757,656,1,'ROLE_partner_api',190,186,'管理者直子',216,'政治資金文書製作所',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   -- 最新でないので除外
   ,(758,657,0,'ROLE_manager',190,186,'管理者次郎',216,'政治資金文書製作所',181,215,'ユーザ','2022-12-05 12:34:56',0,0,'','1947-07-28 23:59:59')
   ;
  
  