DELETE FROM `address_postal`;
ALTER TABLE `address_postal` auto_increment = 0;


INSERT INTO `address_postal` (`address_postal_id`,`postalcode1`,`postalcode2`,`is_latest`,`lg_code`,`address_org`,`address_name`,`is_gyoseiku_data`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) VALUES 
      (833,'100','6415',0,'131016','丸の内東京ビルディング（１５階）','東京都千代田区丸の内東京ビルディング（１５階）',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (834,'100','6415',1,'131016','丸の内東京ビルディング（１５階）','東京都千代田区丸の内東京ビルディング（１５階）',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (835,'100','6415',1,'131016','丸の内東京ビルディング（１５階）','東京都千代田区丸の内東京ビルディング（１５階）',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (836,'100','6415',1,'131016','丸の内東京ビルディング（１５階）','東京都千代田区丸の内東京ビルディング（１５階）',0,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    , (837,'100','6415',1,'131016','丸の内東京ビルディング（１５階）','東京都千代田区丸の内東京ビルディング（１５階）',1,196,190,'管理人　太郎','2026-02-26 20:08:21',0,0,'','1948-07-28 23:59:59')
    ;




