DELETE FROM `task_plan_2025`;
ALTER TABLE `task_plan_2025` auto_increment = 0;

INSERT INTO `task_plan_2025` (`task_plan_id`,`task_plan_code`,`task_info_code`,`task_plan_name`,`table_year`,`is_latest`,`is_start`,`is_finished`,`is_suspended`,`start_datetime`,`end_dateimte`,`role_list`,`transfer_pass`,`task_user_code`,`task_user_name`,`insert_user_id`,`insert_user_code`,`insert_user_name`,`insert_timestamp`,`delete_user_id`,`delete_user_code`,`delete_user_name`,`delete_timestamp`) VALUES 
    (421,187,24,'タスク名称2',2025,0,0,0,0,'2022-12-05 12:34:56','2022-12-06 23:45:12','admin','pass',190,'ユーザ',213,999,'ユーザ','2025-06-06 23:45:12',1,1,'ユーザ','1948-07-29 00:00:00') -- 最新でない
   ,(422,187,24,'タスク名称2',2025,1,0,1,0,'2022-12-05 12:34:56','2022-12-06 23:45:12','admin','pass',190,'ユーザ',213,999,'ユーザ','2025-06-07 23:45:12',1,1,'ユーザ','1948-07-29 00:00:00') -- 終了すみ
   ,(423,187,24,'タスク名称2',2025,1,0,0,0,'2022-12-05 12:34:56','2022-12-06 23:45:12','admin','pass',224,'ユーザ',239,999,'ユーザ','2025-06-08 23:45:12',1,1,'ユーザ','1948-07-29 00:00:00') -- 対象ユーザでない
   ,(424,187,24,'タスク名称2',2025,1,0,0,0,'2022-12-05 12:34:56','2022-12-06 23:45:12','admin','pass',190,'ユーザ',213,999,'ユーザ','2025-06-09 23:45:12',1,1,'ユーザ','1948-07-29 00:00:00') -- 件数外
   ,(425,187,24,'タスク名称2',2025,1,0,0,0,'2022-12-05 12:34:56','2022-12-06 23:45:12','admin','pass',190,'ユーザ',213,999,'ユーザ','2025-06-10 23:45:12',1,1,'ユーザ','1948-07-29 00:00:00') -- 抽出3
   ,(426,187,24,'タスク名称2',2025,1,0,0,0,'2022-12-05 12:34:56','2022-12-06 23:45:12','admin','pass',190,'ユーザ',213,999,'ユーザ','2025-06-11 23:45:12',1,1,'ユーザ','1948-07-29 00:00:00') -- 抽出2
   ,(427,187,24,'タスク名称2',2025,1,0,0,0,'2022-12-05 12:34:56','2022-12-06 23:45:12','admin','pass',190,'ユーザ',213,999,'ユーザ','2025-06-12 23:45:12',1,1,'ユーザ','1948-07-29 00:00:00') -- 抽出1
   ;
